{
  "entries" : [
    {
      "title" : "The Old God's Priestess",
      "description" : "Sunder is a project that I worked (am working) on for my 3rd and final year at the ESMA School of Toulouse. The project is a video game 1v1 multiplayer shooter that takes places in a desert, with both player having access to skills and the ability to claim beacons that are used for respawning if they die.<br><br> My own personal contribution to this project was coding the beacons and respawn system, as well as working on the Main Menu UI's code, and most notably the Settings of the game. <br><br> This was (is) the first project that I worked on in a group that wasn't interrupted by other things (aka, classes with teachers, unlike during my 2nd year), we went about it like a 'real' project, with R&D, pre-prod and production phases. <br><br> I do not think I had some particular difficulties, I didn't work on the networking of the game for exemple, the beacon being the only thing that I could qualify as unique in this project (as in, something that I likely wouldn't work on again after this project) since the UI and settings would be parts that I would most likely work on again in a futur project. And it (the beacon) wasn't the most difficult thing to make, even if I had to work with production constraint, since i couldn't modify some Blueprints as GitHub doesn't handle well Blueprints file (it overwrites the whole file and not just the parts that have been modified)",
      "information" : [
        "Ended",
        "Solo",
        "Study",
        "Unity",
        "C#",
        "--/01/2023",
        "--/05/2023"
      ],
      "entryImageIcon" : "",
      "entryImageIconResolution" : [
        "500px",
        "500px"
      ],
      "highlighed" : false
    },
    {
      "title" : "Overtime",
      "description" : "Sunder is a project that I worked (am working) on for my 3rd and final year at the ESMA School of Toulouse. The project is a video game 1v1 multiplayer shooter that takes places in a desert, with both player having access to skills and the ability to claim beacons that are used for respawning if they die.<br><br> My own personal contribution to this project was coding the beacons and respawn system, as well as working on the Main Menu UI's code, and most notably the Settings of the game. <br><br> This was (is) the first project that I worked on in a group that wasn't interrupted by other things (aka, classes with teachers, unlike during my 2nd year), we went about it like a 'real' project, with R&D, pre-prod and production phases. <br><br> I do not think I had some particular difficulties, I didn't work on the networking of the game for exemple, the beacon being the only thing that I could qualify as unique in this project (as in, something that I likely wouldn't work on again after this project) since the UI and settings would be parts that I would most likely work on again in a futur project. And it (the beacon) wasn't the most difficult thing to make, even if I had to work with production constraint, since i couldn't modify some Blueprints as GitHub doesn't handle well Blueprints file (it overwrites the whole file and not just the parts that have been modified)",
      "information" : [
        "Ended",
        "Team",
        "GameJam",
        "Unity",
        "C#",
        "--/02/2023",
        "--/02/2023"
      ],
      "entryImageIcon" : "",
      "entryImageIconResolution" : [
        "500px",
        "500px"
      ],
      "highlighed" : false
    },
    {
      "title" : "Les Bermudes du Nauscilla",
      "description" : "Sunder is a project that I worked (am working) on for my 3rd and final year at the ESMA School of Toulouse. The project is a video game 1v1 multiplayer shooter that takes places in a desert, with both player having access to skills and the ability to claim beacons that are used for respawning if they die.<br><br> My own personal contribution to this project was coding the beacons and respawn system, as well as working on the Main Menu UI's code, and most notably the Settings of the game. <br><br> This was (is) the first project that I worked on in a group that wasn't interrupted by other things (aka, classes with teachers, unlike during my 2nd year), we went about it like a 'real' project, with R&D, pre-prod and production phases. <br><br> I do not think I had some particular difficulties, I didn't work on the networking of the game for exemple, the beacon being the only thing that I could qualify as unique in this project (as in, something that I likely wouldn't work on again after this project) since the UI and settings would be parts that I would most likely work on again in a futur project. And it (the beacon) wasn't the most difficult thing to make, even if I had to work with production constraint, since i couldn't modify some Blueprints as GitHub doesn't handle well Blueprints file (it overwrites the whole file and not just the parts that have been modified)",
      "information" : [
        "Finished",
        "Team",
        "Study",
        "Unreal Engine 5.4",
        "Blueprints",
        "--/08/2023",
        "29/05/2024"
      ],
      "entryImageIcon" : "",
      "entryImageIconResolution" : [
        "500px",
        "500px"
      ],
      "highlighed" : false
    },
    {
      "title" : "RATé",
      "description" : "Sunder is a project that I worked (am working) on for my 3rd and final year at the ESMA School of Toulouse. The project is a video game 1v1 multiplayer shooter that takes places in a desert, with both player having access to skills and the ability to claim beacons that are used for respawning if they die.<br><br> My own personal contribution to this project was coding the beacons and respawn system, as well as working on the Main Menu UI's code, and most notably the Settings of the game. <br><br> This was (is) the first project that I worked on in a group that wasn't interrupted by other things (aka, classes with teachers, unlike during my 2nd year), we went about it like a 'real' project, with R&D, pre-prod and production phases. <br><br> I do not think I had some particular difficulties, I didn't work on the networking of the game for exemple, the beacon being the only thing that I could qualify as unique in this project (as in, something that I likely wouldn't work on again after this project) since the UI and settings would be parts that I would most likely work on again in a futur project. And it (the beacon) wasn't the most difficult thing to make, even if I had to work with production constraint, since i couldn't modify some Blueprints as GitHub doesn't handle well Blueprints file (it overwrites the whole file and not just the parts that have been modified)",
      "information" : [
        "Finished",
        "Team",
        "GameJam",
        "Unreal Engine 5.4",
        "Blueprints",
        "--/02/2024",
        "--/02/2024"
      ],
      "entryImageIcon" : "",
      "entryImageIconResolution" : [
        "500px",
        "500px"
      ],
      "highlighed" : false
    },
    {
      "title" : "This Website Portfolio",
      "description" : [
        "This project is ... well, what you are currently seeing, this website. I had the want/need to make one for a bit, and with me being in my last year of my studies. I needed to make a portfolio, and then came the idea of making it from scratch, on my own. I can't say it was easy, as I had to learn HTML, CSS and Javascript with zero knowledge about them. But it is a fun project, that I am going to keep working on and upgrading, at least that's my plan for the forseeable future. <br><br> As I am writing this, I am still working on it, it's still a Work In Progress, I still have quite a bit to do, even if things are starting to take shape. But I'm enjoying it, even if it's taking time. I'll write something a bit more professional later as, well, I'm not going to publish it like that.",
        "",
        ""
      ],
      "information" : [
        "Ongoing",
        "Solo",
        "Personal/Pro",
        "Browser",
        "HTML, CSS, JS",
        "20/08/2024",
        "--/--/----"
      ],
      "entryImageIcon" : "",
      "entryImageIconResolution" : [
        "500px",
        "500px"
      ],
      "highlighed" : true
    },
    {
      "title" : "Sunder",
      "description" : [
        "Sunder is a project that I worked on for my 3rd and final year at the ESMA School of Toulouse. The project is a video game 1v1 shooter TPS, with some FPS elements, that takes places in a desert, with both player having access to skills, like the whistle to ping the position of the other player, as well beacons that are scattered around the map that can be claimed and used as respawn point. The players uses a rifle that one shot the other player and they can slide down the sand to gain a speed boost.",
        "",
        "",
        "My own personal contribution to this project was coding the beacons and respawn system, as well as working on the Main Menu UI code, the pause menu UI code and the settings UI code. I also had a hand in debugging some parts of the game, and making the Players' control more fuild and comfortable to use.",
        "",
        "",
        "This was the first project that I worked on in a group that wasn't interrupted by other things (classes with teachers, for exemple), we went about it like a 'real' project, with R&D, pre-prod and production phases. We had deadlines set by the teachers and the school, both so we could get an idea on how it would be in the working world and so we wouldn't overestime the time that have to make our project. We had about 9-ish month to make it, with R&D lasting during October, pre-prod lasting until around December and the production from January to June.",
        "<img src=\"../images/sunder2.png\" alt=\"Sunder Panorama 2\" style=\"width:1005px;height:424px;\">",
        "",
        "I do not think I had some particular difficulties during the development of the game and on what I worked on. The respawn system is something classic, something that I'm probably bound to remake later in my life (as in, in a different project). The interesting part, I think, was mostly caused by production constraint, during the pre-production I wasn't able to make modification on the Player's blueprint (because github do not like Blueprints). I had to make an Actor Component where I put all of the code necessary to link the player to the beacon and vice versa. <br> The respawn system, when a player died, would check if it had a beacon in it's memory, if yes, it made the player respawn to the first beacon claimed that it has in memory, if it didn't have a beacon in memory, it would be game over for the player.",
        "<img src=\"../images/sunderPing.png\" alt=\"Sunder Ping Image\" style=\"width:647px;height:375px;\">",
        "",
        "The beacons are a bit more developped and complexed than the respawn system, even if they are technically part of the respawn system. But once again, I do not think it was something very hard to make. The player has the ability to interact with one, while holding the button to interact, an animation would play out to changes the color of the beacon. <br>If the player complete the claiming process, the color (that matches the player's one) would be fixed for the remainder of the game (unless the other player interact with it). The player that claims the beacon, will be able to use it as a respawn point if they died. Both player would also see day turning into night and the player that claimed the beacon would enter the hunt mode, they would see pings on the other player's location. However, if the player didn't complete the claiming process, and just let go of the button mid-claim, the color of the beacon would decrease until the player's color has dissapear from the beacon.<br> The players also has the ability to steal the other's beacon, if a beacon has already been claimed by an other player, the player can steal it (as implied a bit above). The process is the same, aside that the player being robbed would lose the ability to use the beacon as a respawn point and the new owner of the beacon gain the same bonuses as if they had claimed an empty beacon.",
        "<img src=\"../images/sunderAiming.png\" alt=\"Sunder Aiming Image\" style=\"width:466px;height:216px;\">",
        "<img src=\"../images/sunderDying.png\" alt=\"Sunder Dying Image\" style=\"width:385px;height:216px;\">",
        "I also worked on the UI of the game, well, mostly the Main Menu UI, and the pause menu. Not a lot to say, took me some time to make because I hadn't worked on UI in a while but overhaul, it works, it's nice and I didn't have to work with Multiplayer constraint so it was even easier. I also worked on the settings of the game, took a while as well, this time because I didn't know how it worked, so I had to learn on the fly. I learnt how to make game saves, how key mapping worked, how to make audio parameters and a few other things. <br>Key mapping took a long time to figure out, and it works differently compared to the other settings that I made. The settings that i made are in widgets, one for each type of option, is it a slider ? a checkbox ? a dropbox ? a key ? The 3 first get their functions, titles and options in their respective widget and when a player make a modification, it will be sent to the settings UI where the code to handle the settings is. However, the key mapping widget only gets which key it will use as option and it will sends it's data to the Unreal Engine's native code when a player makes a modification.",
        "",
        "",
        "<h3>Conclusion</h3> My first real video game project that I worked on and saw to fruition. Nothing too complicated, aside from having to learn the multiplayer structure and how it worked, as well as learning how to make Settings and saving them. Overhaul more of a learning experience on how to work in a team rather than learning things for the project. I did enjoy working on this project a lot, even if competitive multiplayer games usually aren't my cup of tea.",
        "<img src=\"../images/sunder1.png\" alt=\"Sunder Panorama 1\" style=\"width:1042px;height:436px;\">",
        ""
      ],
      "information" : [
        "Completed",
        "Team of 10",
        "Study/Pro",
        "Unreal Engine 5.4",
        "Blueprints",
        "07/10/2024",
        "20/06/2025"
      ],
      "entryImageIcon" : "<img src=\"../images/sunderPoster.png\" alt=\"Sunder Poster\" style=\"width:289px;height:414px;\" id=\"entryImageIcon\">",
      "highlighed" : true
    }
  ]
}


