{
  "entries" : [
    {
      "title" : "The Old God's Priestess",
      "description" : ["The Old God's Priestess is a 2D Plateformer with some stealth mechanics made with Unity in a Pixel Art style, it is also my very firs tvideo game that I made and the first video game that I made in solo. It was made for the end of my first year, the project started around january and ended around may, so around 5-6 month to work on it, while classes were still ongoing. I saw a bit too big for what skills I had at the time, the game is technically completable, but there are some many things that are broken or just plain missing.",
        "",
        "",
        "As said just before, the game is a 2D Plateformer with stealth, the player as access to a few skills, one that allows the Priestess (that player's character) to teleport in front of her, allowing to cross some distance. An other skills is the fox transformation, allowing the Priestess to take her fox form, allowing her to move faster, jump higher and go into small holes. An other skill can be used if the player sneaks behind a guard and after a few moments of pressing a button makes the guard dissapear. Aside from that the player can jump and go left and right.",
        "",
        "",
        "The Player can be detected by guards if they stay too long in their field of view (their cones of vision). The goal of the player being to reach the end of the (rather short) level. Not too much to be said, I could speak of the numerous things that should have been in the game or that I just wanted to add to make things better, but let's just talk about what is missing or what I did wrong.",
        "",
        "",
        "A lot of things are currently missing, a lot of animations from the guards, a lot of their behaviours as well. The rather nauseating background, the background scrolls at different speed, if done well it gives the impression of depth, but since it's been done badly on my part, it just looks pretty bad. There exist a difficulty options, they do work but it's not been really well made or thought at all. The level design itself hasn't been thought too deeply as well. Overhaul a lot of things haven't been given as much thought as they should have gotten, it ended up with a half baked game, with a lot of things missing, broken or just badly done. One of the most egrerious problem is the font used for a lot of the in-game text, a lot of the texts is in an elegant and/or complicated font that makes it hard to read properly.",
        "",
        "",
        "<h3>Conclusion</h3> A lot of broken, missing, or just badly done things. One of my first project, which I am weirdly proud seeing how much things are not done. It might not be a good game, or even a finished one, it still allowed me to learn so much things that helped me later down on how I should be working, how I should code, that I should comment all of my code. A huge learning experience overhaul and pretty fun, even if I couldn't do everything that i had wanted to do. I might end up re-doing it one day, who knows, I like the idea, the concept, not so much the execution.",
        "",
        ""
      ],
      "information" : [
        "Ended",
        "Solo",
        "Study",
        "Unity",
        "C#",
        "--/01/2023",
        "--/05/2023",
        "https://eimdawander.itch.io/togp"
      ],
      "entryImageIcon" : "<img src=\"../images/TOGP_Logo.png\" alt=\"The Old God's Priestess' Logo\" style=\"width:256px;height:256px;\" id=\"entryImageIcon\">",
      "highlighed" : false
    },
    {
      "title" : "Overtime",
      "description" : ["Made during a GameJam organized by the school I studied at. It lasted during a weekend and the project overhaul is just ... broken. Not a lot to say about it aside that it's very buggy, we went way over our heads when we tried to make it, way too ambitious.",
        "",
        "",
        "It isn't really worth going into, it was more of a learning experience than anything else, I have linked the itch.io page, but again, not really worth it to take a look. It mostly taught me to avoid working during the whole night to make things work because I won't really be able to be functional the next day with 0 hours of sleep. It also taught me to not expect to be in a team that I like (which ironically the next project I did taught me the same thing). So yeah, not the most fun Jam I did.",
        "",
        ""
      ],
      "information" : [
        "Ended",
        "Team",
        "GameJam",
        "Unity",
        "C#",
        "--/02/2023",
        "--/02/2023",
        "https://fernandes-bastiaan.itch.io/overtime"
      ],
      "entryImageIcon" : "",
      "entryImageIconResolution" : [
        "500px",
        "500px"
      ],
      "highlighed" : false
    },
    {
      "title" : "Les Bermudes du Nauscilla",
      "description" : ["Les Bermudes du Nauscilla (The Nauscilla's Bermuda in english) is a first person Puzzle-Horror game with a unique aesthetic mostly inspired by the game Return of the Obra Dinn. This project was done alongside regular classes during my Second Year at the school I studied in, we had less time to work on it compared to our third year but it was the first time we worked on making a game in a team (not counting Game Jams).<br>My main role in this project was the only programmer during the first half of the development and when an other team fused with us, I was mostly a programmer as well as a rigger.",
        "",
        "",
        "I mostly worked on the mechanics related to hiding and fleeing. The main contribution being my work on the Lighthouse, which as two side that can be independently changed to one of the 3 colors, red, blue and purple. Each colors as different mechanics, with blue allowing some clues to be shown and interacted with. Red showing the monster and allowing him to move and touch the player (which he can't do during a blue phase) and purple doing both at the same time. The trick in itself is that since the colours come form a lighthouse, the colors change depending on which side the lighthouse is showing. With the colours of the lighthouse changing when the player progresses the story.<br> The Ai itself of the monster is a pretty simple one, when he is allowed to move and do things (aka during red and purple) he will either move towards the player and when the player is touched, game over. Or if the player is hidden, he will roam arround without a purpose, until the player stops hidding again.",
        "",
        "",
        "Speaking about hiding, the player as the possibility to hide under or inside some object, which, as said above, make the monsters roam around. I also worked on the inventory system, even if you can't really do much with it, you can just see what is in there. Something I worked on as well is the main menu, settings and UI of the game, not a lot to be said here.",
        "",
        "",
        "Overhaul not a bad experience, I can't really say it was the most fun project I worked on (might have a little burnout at some point) but it was quite interesting, and the aesthetic of the game itself is quite an interesting one even if I'm personally not a fan of Horror game as whole. Oh and it was one of the first game were there as been voice acting (thanks to our english teacher).",
        "",
        "",
        "<h3>RISK OF EPILEPSY</h3><br>I am not really versed into epilepsy and how it works but I do feel like, if you ever want to try this game out, it may causes some problem if you are photosensitive.",
        "",
        ""
      ],
      "information" : [
        "Finished",
        "Team",
        "Study",
        "Unreal Engine 5.4",
        "Blueprints",
        "--/08/2023",
        "29/05/2024",
        "https://ryan-narutail-dias.itch.io/les-bermudes-du-nauscilla"
      ],
      "entryImageIcon" : "",
      "entryImageIconResolution" : [
        "500px",
        "500px"
      ],
      "highlighed" : false
    },
    {
      "title" : "RATé",
      "description" : ["RATé (which is a play on words with the french word for rat and missed/failed) is a 5 minutes long game made for a Game Jam that lasted over a wekk end and that was organized by the School I studied at. It's almost a complete oposite compared to my first game Jam seeing how little there is to do in the game, in a good way since the game is actually finished and I had fun doing it; ",
        "",
        "",
        "Not a lot to be said about this one, it's a 2D plateformer where you control a rat escapping a laboratory. You have some plateforming to do but it's not anything too hard, the most complicated thing you might find is playing around some of the jank physics that exists. Overhaul, a pretty short game, not a lot to be said about it seeing how short it is and how little time we had to do it, I was working on Coding the whole thing, not a lot to be said here from my point of view as the mechanics are really simple.",
        "",
        ""
      ],
      "information" : [
        "Finished",
        "Team",
        "GameJam",
        "Unreal Engine 5.4",
        "Blueprints",
        "--/02/2024",
        "--/02/2024",
        "https://eimdawander.itch.io/rate"
      ],
      "entryImageIcon" : "",
      "entryImageIconResolution" : [
        "500px",
        "500px"
      ],
      "highlighed" : false
    },
    {
      "title" : "This Website Portfolio",
      "description" : [
        "This project page is about the current website you are seeing. It is a website I made to present all of my different project i made over the years, be they good or bad. This project is still ongoing and will probably never really be finished since I'm sure I will always find something to add or change to make this website better. It's currently hosted thanks to github's webpages but that might change and end up being hosted somewhere else in the future.",
        "",
        "",
        "This website uses HTML, CSS and Javascript to make it work, which I had to learn from 0 to make it, partly the reason it took so long to be completed. It is separated in 3 main pages, the main page, aka Home, where I talk a little bit about what this place is as well as some highlights of my projects. The last page which is the About Me, where I talk about me, what my skills are, what coding languages I can write in and comprehend. And last, but definitly not least, the middle page, aka the Project page.",
        "",
        "",
        "The Project page is the most complicated and filled of the three, which a list on the left that serves at showing what projects I have logged and made. A highlight button exist to show (from the start) the highlighted project I made or worked on, as most of the projects I made aren't really worth showcasing but I personally still feel like they should be shown, at least to show how far I've come as well as all of the failure and bad projects I made. <br> Whenever an entry button is clicked the website will read a json file that contains all of the various data of those entires, from the current Status to the dates and as well as all of the main body text, the one you are currently reading. This system makes it so it's pretty easy to have one uniform way for me to enter a new project without having to remake everything. It also allows to put images between the paragraphs of the main body, so it's not as dull and breaks the monotony of reading through swaths of text ",
        "",
        "",
        "Some things that I'd like to mention about this website as well, is the grey bar that serves as background for the list of entries, it doesn't look like it (which is how it's supposed to be) but it changes it's height dynamically depending on the height of the main body. It works quite well and is such a simple fix that I'm pretty happy about, and it avoids having a weird stop in the height of the element, or having it go further than it should in a short entry. <br> The bottom of each pages is also filled with a footer, to close the page nicely and not have a somewhat weird and empty bottom of the page.",
        "",
        "",
        "Overhaul a nice project which I'm quiet proud of, and one that I keep working on to make it better and better, both visually (it was quite an eyesore before) and for me to code or add entries, make it as smooth as possible. This project also taught me how to make a website, which I had no clue how to do so before, I am still learning how to make things of course, because you never stop learning, even in a field you might think you know everything.",
        "",
        ""
      ],
      "information" : [
        "Ongoing",
        "Solo",
        "Personal/Pro",
        "Browser",
        "HTML, CSS, JS",
        "20/08/2024",
        "--/--/----",
        ""
      ],
      "entryImageIcon" : "",
      "entryImageIconResolution" : [
        "500px",
        "500px"
      ],
      "highlighed" : true
    },
    {
      "title" : "Sunder",
      "description" : [
        "Sunder is a project that I worked on for my 3rd and final year at the ESMA School of Toulouse. The project is a video game 1v1 shooter TPS, with some FPS elements, that takes places in a desert, with both player having access to skills, like the whistle to ping the position of the other player, as well beacons that are scattered around the map that can be claimed and used as respawn point. The players uses a rifle that one shot the other player and they can slide down the sand to gain a speed boost.",
        "",
        "",
        "My own personal contribution to this project was coding the beacons and respawn system, as well as working on the Main Menu UI code, the pause menu UI code and the settings UI code. I also had a hand in debugging some parts of the game, and making the Players' control more fuild and comfortable to use.",
        "",
        "",
        "This was the first project that I worked on in a group that wasn't interrupted by other things (classes with teachers, for exemple), we went about it like a 'real' project, with R&D, pre-prod and production phases. We had deadlines set by the teachers and the school, both so we could get an idea on how it would be in the working world and so we wouldn't overestime the time that have to make our project. We had about 9-ish month to make it, with R&D lasting during October, pre-prod lasting until around December and the production from January to June.",
        "<img src=\"../images/sunder02.png\" alt=\"Sunder Panorama 2\" style=\"width:1005px;height:424px;\">",
        "",
        "I do not think I had some particular difficulties during the development of the game and on what I worked on. The respawn system is something classic, something that I'm probably bound to remake later in my life (as in, in a different project). The interesting part, I think, was mostly caused by production constraint, during the pre-production I wasn't able to make modification on the Player's blueprint (because github do not like Blueprints). I had to make an Actor Component where I put all of the code necessary to link the player to the beacon and vice versa. <br> The respawn system, when a player died, would check if it had a beacon in it's memory, if yes, it made the player respawn to the first beacon claimed that it has in memory, if it didn't have a beacon in memory, it would be game over for the player.",
        "<img src=\"../images/sunderPing01.png\" alt=\"Sunder Ping Image\" style=\"width:647px;height:375px;\">",
        "",
        "The beacons are a bit more developped and complexed than the respawn system, even if they are technically part of the respawn system. But once again, I do not think it was something very hard to make. The player has the ability to interact with one, while holding the button to interact, an animation would play out to changes the color of the beacon. <br>If the player complete the claiming process, the color (that matches the player's one) would be fixed for the remainder of the game (unless the other player interact with it). The player that claims the beacon, will be able to use it as a respawn point if they died. Both player would also see day turning into night and the player that claimed the beacon would enter the hunt mode, they would see pings on the other player's location. However, if the player didn't complete the claiming process, and just let go of the button mid-claim, the color of the beacon would decrease until the player's color has dissapear from the beacon.<br> The players also has the ability to steal the other's beacon, if a beacon has already been claimed by an other player, the player can steal it (as implied a bit above). The process is the same, aside that the player being robbed would lose the ability to use the beacon as a respawn point and the new owner of the beacon gain the same bonuses as if they had claimed an empty beacon.",
        "<img src=\"../images/sunderAiming01.png\" alt=\"Sunder Aiming Image\" style=\"width:466px;height:216px;\">",
        "<img src=\"../images/sunderDying01.png\" alt=\"Sunder Dying Image\" style=\"width:385px;height:216px;\">",
        "I also worked on the UI of the game, well, mostly the Main Menu UI, and the pause menu. Not a lot to say, took me some time to make because I hadn't worked on UI in a while but overhaul, it works, it's nice and I didn't have to work with Multiplayer constraint so it was even easier. I also worked on the settings of the game, took a while as well, this time because I didn't know how it worked, so I had to learn on the fly. I learnt how to make game saves, how key mapping worked, how to make audio parameters and a few other things. <br>Key mapping took a long time to figure out, and it works differently compared to the other settings that I made. The settings that i made are in widgets, one for each type of option, is it a slider ? a checkbox ? a dropbox ? a key ? The 3 first get their functions, titles and options in their respective widget and when a player make a modification, it will be sent to the settings UI where the code to handle the settings is. However, the key mapping widget only gets which key it will use as option and it will sends it's data to the Unreal Engine's native code when a player makes a modification.",
        "",
        "",
        "<h3>Conclusion</h3> My first real video game project that I worked on and saw to fruition. Nothing too complicated, aside from having to learn the multiplayer structure and how it worked, as well as learning how to make Settings and saving them. Overhaul more of a learning experience on how to work in a team rather than learning things for the project. I did enjoy working on this project a lot, even if competitive multiplayer games usually aren't my cup of tea.",
        "<img src=\"../images/sunder01.png\" alt=\"Sunder Panorama 1\" style=\"width:1042px;height:436px;\">",
        ""
      ],
      "information" : [
        "Completed",
        "Team of 10",
        "Study/Pro",
        "Unreal Engine 5.4",
        "Blueprints",
        "07/10/2024",
        "20/06/2025",
        "https://linbeuk.itch.io/sunder"
      ],
      "entryImageIcon" : "<img src=\"../images/sunderPoster01.png\" alt=\"Sunder Poster\" style=\"width:289px;height:414px;\" id=\"entryImageIcon\">",
      "highlighed" : true
    }
  ]
}


